ELPasEDT/src/InformationRegisters/ОборудованиеХимЦеха/ОборудованиеХимЦеха.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОборудованиеХимЦеха</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>КонтрольМаксЗначениеКонцентрации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КонтрольМаксЗначениеУровня</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КонтрольМинЗначениеКонцентрации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КонтрольМинЗначениеУровня</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>ОстановкаОборудованияНаГраницеСменыИлиПериода</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПлощадьОснования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </resources>
  <resources>
    <name>РасходИЗакачкаОдновременно</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Реагент</name>
    <type>
      <types>CatalogRef.Реагенты</types>
    </type>
  </resources>
  <resources>
    <name>СостояниеОборудования</name>
    <type>
      <types>EnumRef.СостоянияОборудования</types>
    </type>
  </resources>
  <resources>
    <name>ПоказыватьСостояниеВИнформационнойПанелиАРМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СообщающиесяСосуды</name>
    <type>
      <types>CatalogRef.СообщающиесяСосуды</types>
    </type>
  </resources>
  <dimensions>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.Оборудование</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРеагента</name>
    <type>
      <types>EnumRef.ВидыРеагентов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ELPasEDT/src/InformationRegisters/БазовыеЕдиницыИзмеренияРеагентов/БазовыеЕдиницыИзмеренияРеагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>БазовыеЕдиницыИзмеренияРеагентов</name>
  <resources>
    <name>ЕдиницаИзмеренияКоличества</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </resources>
  <resources>
    <name>ЕдиницаИзмеренияКонцентрации</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </resources>
  <resources>
    <name>ЕдиницаИзмеренияПлотности</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </resources>
  <resources>
    <name>БазоваяЕдиницаИзмеренияОбъема</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </resources>
  <dimensions>
    <name>ВидРеагента</name>
    <type>
      <types>EnumRef.ВидыРеагентов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ELPasEDT/src/InformationRegisters/НастройкиПараметровАРМУчетаРеагентов/НастройкиПараметровАРМУчетаРеагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиПараметровАРМУчетаРеагентов</name>
  <resources>
    <name>ЕдиницаИзмеренияКонцентрацииРаствора</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </resources>
  <resources>
    <name>ЕдиницаИзмеренияПлотностиРаствора</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </resources>
  <resources>
    <name>ВыполнятьКонтрольУровня</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Реагент</name>
    <type>
      <types>CatalogRef.Реагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ELPasEDT/src/InformationRegisters/НастройкиУчетаРеагентов/НастройкиУчетаРеагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиУчетаРеагентов</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>БазоваяЕдиницаИзмеренияПлощади</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </resources>
  <resources>
    <name>БазоваяЕдиницаИзмеренияУровня</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </resources>
</mdclass:InformationRegister>

ELPasEDT/src/Enums/СостоянияОборудования/СостоянияОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияОборудования</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>ВРемонте</name>
  </enumValues>
  <enumValues>
    <name>ВыведеноИзЭксплуатации</name>
  </enumValues>
  <enumValues>
    <name>ВРезерве</name>
  </enumValues>
</mdclass:Enum>

ELPasEDT/src/InformationRegisters/ОборудованиеХимЦеха/Forms/ФормаЗаписи/Module.bsl
&НаКлиенте
Процедура РеагентПриИзменении(Элемент)
	РеагентПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура РеагентПриИзмененииНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запись.ВидРеагента = Запись.Реагент.ВидРеагента;
	
	БазоваяЕдиницаИзмеренияОбъема = ПредопределенноеЗначение("Справочник.КлассификаторЕдиницИзмерения.ПустаяСсылка");
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	БазовыеЕдиницыИзмеренияРеагентов.БазоваяЕдиницаИзмеренияОбъема КАК БазоваяЕдиницаИзмеренияОбъема
	|ИЗ
	|	РегистрСведений.БазовыеЕдиницыИзмеренияРеагентов КАК БазовыеЕдиницыИзмеренияРеагентов
	|ГДЕ
	|	БазовыеЕдиницыИзмеренияРеагентов.ВидРеагента = &ВидРеагента");
	Запрос.УстановитьПараметр("ВидРеагента", Запись.ВидРеагента);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		БазоваяЕдиницаИзмеренияОбъема = Выборка.БазоваяЕдиницаИзмеренияОбъема;
	КонецЕсли;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НастройкиПараметровАРМУчетаРеагентов.ЕдиницаИзмеренияКонцентрацииРаствора КАК ЕдиницаИзмеренияКонцентрации
	|ИЗ
	|	РегистрСведений.НастройкиПараметровАРМУчетаРеагентов КАК НастройкиПараметровАРМУчетаРеагентов
	|ГДЕ
	|	НастройкиПараметровАРМУчетаРеагентов.Организация = &Организация
	|	И НастройкиПараметровАРМУчетаРеагентов.Реагент = &Реагент";
	Запрос.УстановитьПараметр("Организация", Запись.Организация);
	Запрос.УстановитьПараметр("Реагент", Запись.Реагент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЕдиницаИзмеренияКонцентрации = Выборка.ЕдиницаИзмеренияКонцентрации;
	Иначе
		ЕдиницаИзмеренияКонцентрации = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	НастройкиУчетаРеагентовСрезПоследних.БазоваяЕдиницаИзмеренияПлощади КАК БазоваяЕдиницаИзмеренияПлощади,
	|	НастройкиУчетаРеагентовСрезПоследних.БазоваяЕдиницаИзмеренияУровня КАК БазоваяЕдиницаИзмеренияУровня
	|ИЗ
	|	РегистрСведений.НастройкиУчетаРеагентов.СрезПоследних КАК НастройкиУчетаРеагентовСрезПоследних");
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		БазоваяЕдиницаИзмеренияПлощади = Выборка.БазоваяЕдиницаИзмеренияПлощади;
		БазоваяЕдиницаИзмеренияУровня = Выборка.БазоваяЕдиницаИзмеренияУровня;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	РеагентПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОборудованиеПриИзмененииНаСервере()
	
	Запись.Организация   = Запись.Оборудование.Организация;
	Запись.Подразделение = Запись.Оборудование.Подразделение;
	
	Если Не ЗначениеЗаполнено(Запись.СостояниеОборудования) Тогда
		Запись.СостояниеОборудования = Перечисления.СостоянияОборудования.ВРаботе;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОборудованиеПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Запись.Оборудование) Тогда
		ОборудованиеПриИзмененииНаСервере();
	Иначе
		Запись.Организация   = Неопределено;
		Запись.Подразделение = Неопределено;
	КонецЕсли;
КонецПроцедуры
